app/controllers/api/companies_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."slug" = $1 LIMIT 1  [["slug", "microsoft"]]
---
  def index
    if params[:slug]
      @company = Company.includes(:articles).find_by_slug(params[:slug])